#+TITLE: CS2106 Operating Systems
* Tutorial 8
1. page 0,1: =text=, pages 2,3: =data=
   a. Page table:
      | page# |  frame# | valid |
      |-------+---------+-------|
      |     0 |       5 |     1 |
      |     1 |       2 |     1 |
      |     2 |      10 |     1 |
      |     3 | (blank) |     0 |

      | page | content | frame |
      |------+---------+-------|
      |    0 | inst 1  |     5 |
      |      | inst 2  |       |
      |      | inst 3  |       |
      |      | inst 4  |       |
      |    1 | inst 5  |     2 |
      |      | inst 6  |       |
      |      | word 1  |       |
      |      | word 2  |       |
      |    2 | word 3  |    10 |
      |      | word 4  |       |
      |      | word 5  |       |
      |      | -       |       |
      |    3 | -       |     9 |
      |      | -       |       |
      |      | -       |       |
      |      | -       |       |

      | processor action | logical address | physical address |
      |------------------+-----------------+------------------|
      | fetch inst 1     | =0000= 0        | =010100= 20      |
      | load word 2      | =0111= 7        | =001011= 11      |
      | load word 3      | =1000= 8        | =101000= 49      |
      | load word 6      | =1011= 11       | =100111= 39      |
   b. Segment table:
      | segment  | base address | limit |
      |----------+--------------+-------|
      | 0 (text) |           50 |     6 |
      | 1 (data) |           23 |     5 |

      | action       | Logical address | physical address |
      |--------------+-----------------+------------------|
      | fetch inst 1 | =0,0=           |               50 |
      |              | =1,1=           |               24 |
      |              | =1,2=           |               25 |
      |              | =1,5=           |         segfault |
   c. Segment/page table:
      | segment | pages | frame | valid |
      |---------+-------+-------+-------|
      | text    |     0 |     7 |     1 |
      |         |     1 |     4 |     1 |
      |         |     2 |     1 |     0 |
      |         |     3 |     2 |     0 |
      | data    |     0 |     9 |     1 |
      |         |     1 |     3 |     1 |
      |         |     2 |    14 |     0 |
      |         |     3 |     6 |     0 |

      | processor action | logical address | physical address |
      |------------------+-----------------+------------------|
      | fetch inst 1     | =0,0,00=        | =0111,00= 28     |
      | load word 2      | =1,0,01=        | =1001,10= 37     |
      | load word 3      | =1,0,10=        | =1001,11= 38     |
      | load word 6      | =1,1,10=        | =0011,10= 14     |
2. Design 3, since it is dynamic.
3.
   a. Global variable in the text segment.
      1. Query page table (50ns)
      2. Get the data (50ns)
   b. In the case of hit: just 50ns. otherwise 100.
      #+BEGIN_SRC python :results output
print(50*0.75+100*0.25)
      #+END_SRC
      #+RESULTS:
      : 62.5
   c. no of entries = 75% of the number of frames in RAM.
      write memory efficient programs.
      0.75 * (2^32 / 2^12)
      32 to 1024 in real life with 99% hit rate due to temporal and spatial locality
4. Internal fragmentation is related to the minimum memory chunk size. If it is
   =2^k= bytes, then the average internal fragmentation
   \[\sum^{2^k-1}_{i=1}\frac{i}{2^k} = \frac{2^k(2^k-1)}{2^{k+1}} =
   \frac{2^k-1}{2}\]
5.
   a. *Contiguous memory allocation*: Impossible for contiguous, since we have no way of allocating extra memory
      space if it runs out. Or possibly, can throw runtime error.
   b. *Pure paging*: You can keep getting new pages until all memory have exhausted.
   c. *Pure segmentation*: You can possibly grow each segment.
6.
   a. Use the same page table, but with its write bits set to 0.
   b. When child or parent process is going to write to any page.
   c. An extra bit denoting has forked. if attempt to write and the bit is set,
      then copy the memory.
